In [43]:
import pandas as pd
import glob
import os

In [51]:
fields2 = ['tpep_pickup_datetime', 'tpep_dropoff_datetime','passenger_count','trip_distance','RatecodeID','PULocationID','DOLocationID','payment_type','fare_amount','extra','mta_tax','tip_amount','tolls_amount','total_amount']

In [ ]:
df2018y = pd.read_csv('data/yellow_tripdata_2018-03.csv', skipinitialspace=True, usecols=fields2)
df2018y.size

In [68]:
df2018y.isnull().sum()

tpep_pickup_datetime     0
tpep_dropoff_datetime    0
passenger_count          0
trip_distance            0
RatecodeID               0
PULocationID             0
DOLocationID             0
payment_type             0
fare_amount              0
extra                    0
mta_tax                  0
tip_amount               0
tolls_amount             0
total_amount             0
dtype: int64

In [72]:
df2018y.duplicated().sum()

0

In [53]:
data_top = df2018y.head()
data_top

,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,RatecodeID,PULocationID,DOLocationID,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,total_amount
0,2018-03-01 00:01:34,2018-03-01 00:01:43,1,0.0,1,145,145,2,2.5,0.5,0.5,0.00,0.0,3.80
1,2018-03-01 00:14:34,2018-03-01 00:28:13,1,3.3,1,151,244,1,13.0,0.5,0.5,2.85,0.0,17.15
2,2018-03-01 00:51:25,2018-03-01 00:59:54,1,2.7,1,238,152,2,10.0,0.5,0.5,0.00,0.0,11.30
3,2018-03-01 00:00:01,2018-03-01 00:00:17,1,0.0,1,145,145,2,2.5,0.5,0.5,0.00,0.0,3.80
4,2018-03-01 00:55:10,2018-03-01 00:56:36,1,3.7,1,145,145,2,3.0,0.5,0.5,0.00,0.0,4.30

In [54]:
data_bot = df2018y.tail()
data_bot

,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,RatecodeID,PULocationID,DOLocationID,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,total_amount
9430371,2018-03-31 23:34:47,2018-03-31 23:55:17,5,4.11,1,186,263,1,17.0,0.5,0.5,1.00,0.0,19.30
9430372,2018-03-31 23:02:38,2018-03-31 23:13:10,6,1.50,1,100,107,1,8.5,0.5,0.5,1.47,0.0,11.27
9430373,2018-03-31 23:15:58,2018-03-31 23:30:29,6,2.07,1,107,170,2,11.0,0.5,0.5,0.00,0.0,12.30
9430374,2018-03-31 23:05:37,2018-03-31 23:18:31,2,1.60,1,163,164,2,10.0,0.5,0.5,0.00,0.0,11.30
9430375,2018-03-31 23:37:11,2018-03-31 23:56:53,1,3.90,1,144,161,2,16.0,0.5,0.5,0.00,0.0,17.30

In [62]:
df2020y= pd.read_csv('data/yellow_tripdata_2020-03.csv', skipinitialspace=True, usecols=fields2)
df2020y.size

42102088

In [84]:
df2020y.isnull().sum()

tpep_pickup_datetime     0
tpep_dropoff_datetime    0
passenger_count          0
trip_distance            0
RatecodeID               0
PULocationID             0
DOLocationID             0
payment_type             0
fare_amount              0
extra                    0
mta_tax                  0
tip_amount               0
tolls_amount             0
total_amount             0
dtype: int64

In [83]:
df2020y = df2020y.dropna(subset=['payment_type'])

In [73]:
df2020y.duplicated().sum()

0

In [56]:
data_top2 = df2020y.head()
data_top2

,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,RatecodeID,PULocationID,DOLocationID,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,total_amount
0,2020-03-01 00:31:13,2020-03-01 01:01:42,1.0,4.70,1.0,88,255,1.0,22.0,3.0,0.5,2.00,0.0,27.80
1,2020-03-01 00:08:22,2020-03-01 00:08:49,1.0,0.00,1.0,193,193,2.0,2.5,0.5,0.5,0.00,0.0,3.80
2,2020-03-01 00:52:18,2020-03-01 00:59:16,1.0,1.10,1.0,246,90,1.0,6.0,3.0,0.5,1.95,0.0,11.75
3,2020-03-01 00:47:53,2020-03-01 00:50:57,2.0,0.87,1.0,151,238,1.0,5.0,0.5,0.5,1.76,0.0,10.56
4,2020-03-01 00:43:19,2020-03-01 00:58:27,0.0,4.40,1.0,79,261,1.0,16.5,3.0,0.5,4.05,0.0,24.35

In [86]:
data_bot2 = df2020y.tail()
data_bot2

,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,RatecodeID,PULocationID,DOLocationID,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,total_amount
2969800,2020-03-31 23:18:36,2020-03-31 23:21:26,5.0,0.52,1.0,236,236,2.0,4.0,0.5,0.5,0.00,0.0,7.80
2969801,2020-03-31 23:39:18,2020-03-31 23:50:17,5.0,2.35,1.0,263,166,1.0,10.5,0.5,0.5,2.86,0.0,17.16
2969802,2020-03-31 23:24:48,2020-03-31 23:31:54,5.0,1.33,1.0,140,162,1.0,7.0,0.5,0.5,2.20,0.0,13.00
2969803,2020-03-31 23:41:03,2020-03-31 23:44:23,6.0,0.87,1.0,140,229,1.0,5.0,0.5,0.5,2.64,0.0,11.44
2969804,2020-03-31 23:57:09,2020-04-01 00:06:52,6.0,2.80,1.0,140,100,1.0,10.5,0.5,0.5,1.00,0.0,15.30